{
    "Dale Banham": {
        "description": "He is an Honorary Fellow of the Historical Association and the Schools History Project. He currently delivers training on curriculum development and raising attainment in history for many schools and Trusts. He also works for ITT providers, delivering history specific training for Secondary and Primary trainee teachers and ECTs. Dale has written many articles for educational journals such as ‘Teaching History’. He has published several KS3 and GCSE History textbooks for Hodder Education and worked as a consultant for archive collections and the Imperial War Museum. Dale has been a Head of History and a County Adviser for Humanities (covering all Key Stages). \n\n Dale was a Senior Leader at a large comprehensive school for 14 years, where he was responsible for curriculum development, teaching and learning and CPD. He has always been involved in educational research, in particular: effective revision methods, utilising the power of feedback, literacy, diversity and inclusion. In 2024, his school was recognised as a national ‘Centre of Excellence’ for inclusion, as part of the IQM Inclusive School Award.",
        "subject": "History",
        "profileImagePath": "staffImages/daleBanham.png",
        "qualifications": "BA (Hons) MA (Education)"
    },
    "Russell": {
        "description": "He is an inspirational presenter and tutor, highly experienced in delivering excellent outcomes for students and building capacity in successful teams. He has been a Head of Sixth Form, Head of Teaching and Learning, a Director of Professional Development and Head of Memory for Learning. He is a highly regarded public speaker who has spoken at Teaching and Learning events across the country. In addition, he has organised National Teaching Conferences focussing on effective CPD models and developing teaching learning.\n\n As a highly regarded English specialist, and an examiner for English Literature, he is available to work with English teachers and students on improving outcomes at all levels. Similarly, as a teacher of Film Studies he is available to work in a similar style on advising on how to set up, develop and lead on the subject. Russell also delivers high impact, bespoke revisions skills sessions to students (as a personal tutor) and schools.",
        "subject": "English",
        "profileImagePath": "staffImages/russell.jpeg"
    }
}